In [1]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:90% !important;}
div.cell.code_cell.rendered{width:100%;}
div.input_prompt{padding:0px;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.text_cell_render.rendered_html{font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:12px;}
</style>
"""))

# 패키지 로드

In [2]:
import pandas as pd

# 데이터 백업

In [22]:
sw_pd.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구열처리백업.csv', index=False)

In [3]:
sw_pd = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구열처리백업.csv')
sw_pd.head(1)

      기준년월일     행정동코드  시간대 성별  연령별  요일   매출금액  매출건수
0  20230101  41115650    1  F    6   7  14393     2

In [7]:
sw_pd_gender_sum.to_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구성별합백업.csv', index=False)

In [8]:
sw_pd_gender_sum = pd.read_csv('c:/Users/Admin/AI/downloads/카드소비데이터 수원시/수원시팔달구성별합백업.csv')
sw_pd_gender_sum.head(1)

      기준년월일     행정동코드  시간대  연령별  요일   매출금액  매출건수
0  20230101  41115650    1    2   7  17678     2

# 수원시 카페 데이터(23-25)

In [5]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20230{i}_수원시.csv') for i in range(1,10)]
df_23_1 = pd.concat(df, ignore_index=True)
df_23_1.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,D02,소매/유통,건강/기호식품,5,F,5,7,99502,2

In [6]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_2023{i}_수원시.csv') for i in range(10,13)]
df_23_2 = pd.concat(df, ignore_index=True)
df_23_2.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20231001,41111,41111560,D02,소매/유통,건강/기호식품,3,M,7,7,99502,2

In [7]:
df_23_1 = df_23_1[df_23_1['card_tpbuz_nm_2']=='커피/음료']
df_23_2 = df_23_2[df_23_2['card_tpbuz_nm_2']=='커피/음료']
df_23 = pd.concat([df_23_1, df_23_2]).reset_index(drop=True)
df_23.head(2)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q13,음식,커피/음료,1,F,3,7,259309,2
1,20230101,41111,41111560,Q13,음식,커피/음료,1,M,3,7,62359,9

In [8]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20240{i}_수원시.csv') for i in range(1,10)]
df_24_1 = pd.concat(df, ignore_index=True)
df_24_1.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20240101,41111,41111560,D02,소매/유통,건강/기호식품,4,F,7,1,32339,3

In [9]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_2024{i}_수원시.csv') for i in range(10,12)]
df_24_2 = pd.concat(df, ignore_index=True)
df_24_2.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20241001,41111,41111560,D01,소매/유통,가전제품,4,M,5,2,167558,2

In [10]:
df_24_3 = pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_202412_수원시.csv', encoding='cp949') 
df_24_3.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20241201,41111,41111560,D02,소매/유통,건강/기호식품,3,M,3,7,181077,5

In [11]:
df_24_1 = df_24_1[df_24_1['card_tpbuz_nm_2']=='커피/음료']
df_24_2 = df_24_2[df_24_2['card_tpbuz_nm_2']=='커피/음료']
df_24_3 = df_24_3[df_24_3['card_tpbuz_nm_2']=='커피/음료']
df_24 = pd.concat([df_24_1, df_24_2, df_24_3]).reset_index(drop=True)
df_24.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20240101,41111,41111560,Q13,음식,커피/음료,1,F,3,1,15019,5

In [12]:
df = [pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_20250{i}_수원시.csv') for i in range(1,10)]
df_25_1 = pd.concat(df, ignore_index=True)
df_25_1.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20250101,41111,41111560,D02,소매/유통,건강/기호식품,3,M,4,3,144301,2

In [13]:
df_25_2 = pd.read_csv(f'c:/Users/Admin/AI/downloads/카드소비데이터 수원시/tbsh_gyeonggi_day_202510_수원시.csv')
df_25_2.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20251001,41111,41111560,D01,소매/유통,가전제품,3,F,6,3,379702,2

In [14]:
df_25_1 = df_25_1[df_25_1['card_tpbuz_nm_2']=='커피/음료']
df_25_2 = df_25_2[df_25_2['card_tpbuz_nm_2']=='커피/음료']
df_25 = pd.concat([df_25_1, df_25_2]).reset_index(drop=True)
df_25.head(1)

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20250101,41111,41111560,Q13,음식,커피/음료,1,F,3,3,43023,3

In [15]:
df_23.shape, df_24.shape, df_25.shape

((1558156, 12), (1609414, 12), (1354069, 12))

In [16]:
df_23_25 = pd.concat([df_23, df_24, df_25]).reset_index(drop=True)
df_23_25

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41111,41111560,Q13,음식,커피/음료,1,F,3,7,259309,2
1,20230101,41111,41111560,Q13,음식,커피/음료,1,M,3,7,62359,9
2,20230101,41111,41111560,Q13,음식,커피/음료,1,M,4,7,7822,2
3,20230101,41111,41111560,Q13,음식,커피/음료,1,M,5,7,23780,3
4,20230101,41111,41111560,Q13,음식,커피/음료,1,M,7,7,3755,2
...,...,...,...,...,...,...,...,...,...,...,...,...
4521634,20251031,41117,41117610,Q13,음식,커피/음료,10,F,5,5,91990,2
4521635,20251031,41117,41117610,Q13,음식,커피/음료,10,M,3,5,25344,6
4521636,20251031,41117,41117610,Q13,음식,커피/음료,10,M,4,5,2085,2
4521637,20251031,41117,41117610,Q13,음식,커피/음료,10,M,5,5,81039,2
4521638,20251031,41117,41117610,Q13,음식,커피/음료,10,M,6,5,6884,2

# 행정동 데이터

In [17]:
code_all = pd.read_excel('data/행정동코드.xlsx')
code_sw_pd = code_all[code_all['시군구명']=='수원시 팔달구'].reset_index(drop=True)
code_sw_pd = code_sw_pd.drop(0).reset_index(drop=True)
code_sw_pd['행정동코드'] = code_sw_pd['행정동코드']//100
code_sw_pd

      행정동코드  시도명     시군구명  읍면동명      생성일자  말소일자
0  41115650  경기도  수원시 팔달구   매교동  20031124   NaN
1  41115660  경기도  수원시 팔달구   매산동  20031124   NaN
2  41115670  경기도  수원시 팔달구   고등동  20031124   NaN
3  41115680  경기도  수원시 팔달구  화서1동  20031124   NaN
4  41115690  경기도  수원시 팔달구  화서2동  20031124   NaN
5  41115700  경기도  수원시 팔달구    지동  20031124   NaN
6  41115710  경기도  수원시 팔달구  우만1동  20031124   NaN
7  41115720  경기도  수원시 팔달구  우만2동  20031124   NaN
8  41115730  경기도  수원시 팔달구   인계동  20031124   NaN
9  41115740  경기도  수원시 팔달구   행궁동  20070806   NaN

In [18]:
code_sw_pd_num = code_sw_pd['행정동코드'].to_list()
code_sw_pd_num

[41115650,
 41115660,
 41115670,
 41115680,
 41115690,
 41115700,
 41115710,
 41115720,
 41115730,
 41115740]

# 수원 팔달구 데이터

In [19]:
sw_pd = df_23_25[df_23_25['admi_cty_no'].isin(code_sw_pd_num)]
sw_pd = sw_pd.reset_index(drop=True)
sw_pd

,ta_ymd,cty_rgn_no,admi_cty_no,card_tpbuz_cd,card_tpbuz_nm_1,card_tpbuz_nm_2,hour,sex,age,day,amt,cnt
0,20230101,41115,41115650,Q13,음식,커피/음료,1,F,6,7,14393,2
1,20230101,41115,41115650,Q13,음식,커피/음료,1,M,2,7,17678,2
2,20230101,41115,41115650,Q13,음식,커피/음료,1,M,3,7,17215,9
3,20230101,41115,41115650,Q13,음식,커피/음료,1,M,4,7,22685,6
4,20230101,41115,41115650,Q13,음식,커피/음료,1,M,5,7,23689,5
...,...,...,...,...,...,...,...,...,...,...,...,...
977156,20251031,41115,41115740,Q13,음식,커피/음료,9,M,7,5,31289,2
977157,20251031,41115,41115740,Q13,음식,커피/음료,10,F,3,5,78185,8
977158,20251031,41115,41115740,Q13,음식,커피/음료,10,F,4,5,1564,2
977159,20251031,41115,41115740,Q13,음식,커피/음료,10,F,6,5,105867,2
977160,20251031,41115,41115740,Q13,음식,커피/음료,10,M,4,5,75720,8

In [20]:
not_use = ['cty_rgn_no', 'card_tpbuz_cd', 'card_tpbuz_nm_1', 'card_tpbuz_nm_2']
sw_pd.drop(not_use, axis=1, inplace=True)
sw_pd

          ta_ymd  admi_cty_no  hour sex  age  day     amt  cnt
0       20230101     41115650     1   F    6    7   14393    2
1       20230101     41115650     1   M    2    7   17678    2
2       20230101     41115650     1   M    3    7   17215    9
3       20230101     41115650     1   M    4    7   22685    6
4       20230101     41115650     1   M    5    7   23689    5
...          ...          ...   ...  ..  ...  ...     ...  ...
977156  20251031     41115740     9   M    7    5   31289    2
977157  20251031     41115740    10   F    3    5   78185    8
977158  20251031     41115740    10   F    4    5    1564    2
977159  20251031     41115740    10   F    6    5  105867    2
977160  20251031     41115740    10   M    4    5   75720    8

[977161 rows x 8 columns]

In [5]:
sw_pd.columns = ['기준년월일', '행정동코드', '시간대', '성별', '연령별', '요일', '매출금액', '매출건수']
sw_pd.head(10)

      기준년월일     행정동코드  시간대 성별  연령별  요일   매출금액  매출건수
0  20230101  41115650    1  F    6   7  14393     2
1  20230101  41115650    1  M    2   7  17678     2
2  20230101  41115650    1  M    3   7  17215     9
3  20230101  41115650    1  M    4   7  22685     6
4  20230101  41115650    1  M    5   7  23689     5
5  20230101  41115650    1  M    6   7   5945     2
6  20230101  41115650    2  F    3   7   8917     2
7  20230101  41115650    2  M    4   7   5006     2
8  20230101  41115650    2  M    5   7  13924     2
9  20230101  41115650    2  M    6   7   7666     2

In [6]:
sw_pd_gender_sum = (sw_pd.groupby(['기준년월일', '행정동코드', '시간대', '연령별', '요일'], as_index=False)[['매출금액','매출건수']].sum())
sw_pd_gender_sum.head(10)

      기준년월일     행정동코드  시간대  연령별  요일    매출금액  매출건수
0  20230101  41115650    1    2   7   17678     2
1  20230101  41115650    1    3   7   17215     9
2  20230101  41115650    1    4   7   22685     6
3  20230101  41115650    1    5   7   23689     5
4  20230101  41115650    1    6   7   20338     4
5  20230101  41115650    2    3   7    8917     2
6  20230101  41115650    2    4   7    5006     2
7  20230101  41115650    2    5   7   13924     2
8  20230101  41115650    2    6   7    7666     2
9  20230101  41115650    3    4   7  146089    17